run/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/finite-area/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(jouleHeatingSource:V) Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
    // Generic names (without region)
    laplacian((kappas*hs),Ts) Gauss linear corrected;
    laplacian((hs*jouleHeatingSource:sigma),jouleHeatingSource:V) Gauss linear corrected;

    // Same but with specified suffix
    laplacian((kappas*hs_shell),Ts_shell) Gauss linear corrected;
    laplacian((hs_shell*jouleHeatingSource:sigma),jouleHeatingSource:V) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

lnGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
